---
kind: method
id: M:Autodesk.Revit.DB.Structure.Truss.SetProfile(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.CurveArray)
zh: 桁架
source: html/5d80c385-94dd-4601-f83a-1e7db3662a25.htm
---
# Autodesk.Revit.DB.Structure.Truss.SetProfile Method

**中文**: 桁架

Add or modify the profile of a truss.

## Syntax (C#)
```csharp
public void SetProfile(
	CurveArray topChords,
	CurveArray bottomChords
)
```

## Parameters
- **topChords** (`Autodesk.Revit.DB.CurveArray`) - The curves serving as top chords of the truss.
- **bottomChords** (`Autodesk.Revit.DB.CurveArray`) - The curves serving as bottom chords of the truss.